Config/Catalogs/ChatBots.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ChatBots</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Server</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseSsl</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>offset</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsActive</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WebhookKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MasterPassword</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseConsumption</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseConsumptionHierarchy</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseMiniBar</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MiniBarRootElement</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Services</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MiniBarMaxValue</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseAutoOperationControl</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EngineerDepartment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Departments</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VirtualOperations</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Operations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Proxy</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.InternetConnectionSettings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>session_lifetime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ShowGuestsLastName</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BotType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.BotTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>EngineerDepartments</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Departments</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Departments</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TaskType</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/BotTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>BotTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MAX</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ChatBots/Forms/ItemForm/Ext/Form/Module.bsl
#Region FormEventHandlers

// --------------------------------------------------------------------------------
&AtServer
Procedure OnCreateAtServer(pCancel, pStandardProcessing) 
	UpdateForm();
EndProcedure // OnCreateAtServer

// --------------------------------------------------------------------------------
&AtClient
Procedure BeforeWrite(pCancel, pWriteParameters)
	If Not Object.IsActive Then
		Return;
	EndIf;
	
	UpdateForm();
	
	If Not Object.UseMiniBar Then
		Return;
	EndIf;
	
	If Not ValueIsFilled(Object.MiniBarRootElement) Then
		pCancel = True;
		tcCommonFunctionOnClientServer.TextMessage(NStr("ru = 'Поле ""Корневая папка минибара"" не заполнено!';en = 'Field ""Mini bar root folder"" is not filled!'"));
	EndIf;
	
	If Not ValueIsFilled(Object.MiniBarMaxValue) Then
		pCancel = True;
		tcCommonFunctionOnClientServer.TextMessage(NStr("ru = 'Поле ""Макс. кол. элементов"" не заполнено!';en = 'Field ""Mini-bar max value"" is not filled!'"));	
	EndIf;
EndProcedure // BeforeWrite

// --------------------------------------------------------------------------------
&AtServer
Procedure OnReadAtServer(pCurrentObject)
	Items.Description.ReadOnly = True;
EndProcedure // OnReadAtServer

#EndRegion

#Region FormHeaderItemsEventHandlers

// --------------------------------------------------------------------------------
&AtClient
Procedure MiniBarOnChange(pItem)
	UpdateForm();
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure EngineerDepartmentsOnActivateRow(pItem)
	If pItem.CurrentData = Undefined Or pItem.CurrentData.ID <> 0 Then
		Return;
	EndIf;
	
	pItem.CurrentData.ID = Object.EngineerDepartments.Count();
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure DecorationCheckLinkClick(pItem)
	BeginRunningApplication(New NotifyDescription, TrimAll(Object.WebhookKey)+"/"+TrimAll(Object.Description)+"?hello=OK");
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure BotTypeOnChange(pItem)
	UpdateForm();
EndProcedure // BotTypeOnChange

#EndRegion

#Region FormCommandsEventHandlers

// --------------------------------------------------------------------------------
&AtClient
Procedure CheckConnection(pCommand)
	If Modified And (Not CheckFilling() Or Not Write()) Then
		Return;
	EndIf;
	
	CheckConnectionServer();
EndProcedure // CheckConnection

// --------------------------------------------------------------------------------
&AtClient
Procedure SetWebhook(pCommand)
	If Modified And (Not CheckFilling() Or Not Write()) Then
		Return;
	EndIf;
	
	SetWebhookAtServer();
EndProcedure // SetWebhook

// --------------------------------------------------------------------------------
&AtClient
Procedure GetWebhookInfo(pCommand)
	If Modified And (Not CheckFilling() Or Not Write()) Then
		Return;
	EndIf;
	
	GetWebhookInfoAtServer();
EndProcedure // GetWebhookInfo

// --------------------------------------------------------------------------------
&AtClient
Procedure DeleteWebhook(pCommand)
	If Modified And (Not CheckFilling() Or Not Write()) Then
		Return;
	EndIf;
	
	DeleteWebhookAtServer();
EndProcedure // DeleteWebhook

#EndRegion

#Region Private

// --------------------------------------------------------------------------------
&AtServer
Function CheckConnectionServer()
	vAPI = Undefined;
	
	vAPI = cmGetChatBotAPI(Object.BotType);
	
	If vAPI = Undefined Then
		vErr = Nstr("en = 'Unknown integration type'; de = 'Unbekannter Integrationstyp'; ru = 'Неизвестный тип интеграции'");
		tcCommonFunctionOnClientServer.TextMessage("Error: " + vErr);
		Return False;
	EndIf;
	
	vResponse = vAPI.CheckConnection(Object.Ref);
	If Not vResponse.Result Then
		tcCommonFunctionOnClientServer.TextMessage("Error: " + vResponse.Error);
		Return False;
	EndIf;
	
	tcCommonFunctionOnClientServer.TextMessage("Bot name: " + vResponse.UserName);
	Return True;
EndFunction // CheckConnectionServer

// --------------------------------------------------------------------------------
&AtServer
Procedure SetWebhookAtServer()
	vAPI = cmGetChatBotAPI(Object.BotType);
	
	If vAPI = Undefined Then
		vErr = Nstr("en = 'Unknown integration type'; de = 'Unbekannter Integrationstyp'; ru = 'Неизвестный тип интеграции'");
		tcCommonFunctionOnClientServer.TextMessage("Error: " + vErr);
		Return;
	EndIf;
	
	vAPI.SetWebHook(Object.Ref);
EndProcedure // SetWebhookAtServer

// --------------------------------------------------------------------------------
&AtServer
Procedure GetWebhookInfoAtServer()
	vAPI = cmGetChatBotAPI(Object.BotType);
	
	If vAPI = Undefined Then
		vErr = Nstr("en = 'Unknown integration type'; de = 'Unbekannter Integrationstyp'; ru = 'Неизвестный тип интеграции'");
		tcCommonFunctionOnClientServer.TextMessage("Error: " + vErr);
		Return;
	EndIf;
	
	vAPI.getWebhookInfo(Object.Ref);
EndProcedure // GetWebhookInfoAtServer

// --------------------------------------------------------------------------------
&AtServer
Procedure DeleteWebhookAtServer()
	vAPI = cmGetChatBotAPI(Object.BotType);
	
	If vAPI = Undefined Then
		vErr = Nstr("en = 'Unknown integration type'; de = 'Unbekannter Integrationstyp'; ru = 'Неизвестный тип интеграции'");
		tcCommonFunctionOnClientServer.TextMessage("Error: " + vErr);
		Return;
	EndIf;
	
	vAPI.deleteWebhook(Object.Ref);
EndProcedure // DeleteWebhookAtServer

// --------------------------------------------------------------------------------
&AtServer
Procedure UpdateForm()
	Items.MiniBarRootElement.Enabled = Object.UseMiniBar;
	Items.MiniBarMaxValue.Enabled = Object.UseMiniBar;
	
	If Object.BotType = Enums.BotTypes.MAX Then
		Items.Server.InputHint = "platform-api.max.ru";
	Else
		Items.Server.InputHint = "api.telegram.org";
	EndIf;
EndProcedure // UpdateForm

#EndRegion
